{
  "navbar": {
    "home": "Home",
    "popularGames": "Popular Free Games",
    "login": "Login",
    "register": "Register",
    "language": "Language",
    "member": "Member Area",
    "hello": "Hi",
    "logout": "logout"
  },
  "languages": {
    "en": "English",
    "zh-TW": "ç¹é«”ä¸­æ–‡",
    "zh-CN": "ç®€ä½“ä¸­æ–‡",
    "zh-HK": "ç®€ä½“ä¸­æ–‡-æ¸¯"
  },
  "footer": {
    "adultContentWarning": "This site contains adult content. You must be 18 or older to view it.",
    "termsOfService": "Terms of Service",
    "privacyPolicy": "Privacy Policy",
    "contactUs": "Contact Us"
  },
  "home": {
    "popularGames": "Popular Free Games",
    "more": "View More",
    "reserve": "Pre-order Now"
  },
  "game": {
    "naruto": "Narutoï¼šShinobi Exam",
    "raikage": "Raikageï¼šShinobi Exam",
    "kazekage": "Kazekageï¼šShinobi Exam",
    "threeKingdoms": "Three Kingdomsï¼šOne Unified World",
    "sixKingdoms": "Six Kingdomsï¼šOne Unified World",
    "description": "",
    "play": "PLAY",
    "reserve": "Reserve"
  },
  "login": {
    "title": "Member Login",
    "username": "Username",
    "password": "Password",
    "enterUsername": "Enter your username",
    "enterPassword": "Enter your password",
    "loginBtn": "Login",
    "agreePolicy": "By logging in, you agree to our",
    "privacyPolicy": "Privacy Policy"
  },
  "register-login": {
    "title": "Don't have an account?",
    "registerBtn": "Register (Free)",
    "forgotPassword": "Forgot Password"
  },
  "tips": {
    "loginIssueTitle": "Incorrect username or password",
    "loginIssueContent": "Check uppercase, lowercase letters, and numbers, then enter the correct information again.",
    "registerTitle": "How to register?",
    "registerContent": "If you haven't registered yet, please use [Register] to create an account."
  },
  "register": {
    "title": "Register Account",
    "username": "Username",
    "enterUsername": "Enter your username",
    "password": "Password",
    "enterPassword": "Enter your password",
    "confirmPassword": "Confirm Password",
    "enterConfirmPassword": "Re-enter your password",
    "registerBtn": "Register",
    "agreePolicy": "By registering, you agree to our",
    "privacyPolicy": "Privacy Policy"
  },
  "login-register": {
    "alreadyHaveAccount": "Already have an account?",
    "loginBtn": "Login"
  },
  "forgotPassword": {
    "title": "Forgot Password",
    "emailLabel": "Email",
    "emailPlaceholder": "Enter your email",
    "uploadLabel": "Upload proof (max 3 files)",
    "uploadPlaceholder": "Drag & drop or click to upload",
    "submit": "Submit",
    "maxFiles": "Max 3 files allowed",
    "uploadRequired": "Please upload a proof file",
    "success": "Submitted! Check your email",
    "submitError": "Submission failed, try again",
    "fetchError": "Failed to fetch data",
    "historyTitle": "Upload History",
    "uploaded": "uploaded",
    "noHistory": "No upload history"
  },
  "tags": {
    "rpg": "RPG",
    "card": "Card Battle",
    "action": "Action",
    "openWorld": "Open World"
  },
  "platforms": {
    "android": "Android",
    "ios": "iOS",
    "pc": "PC"
  },
  "hot": {
    "title": "Hot Free Games",
    "filter-platform": "Device Type",
    "filter-genre": "Game Genre",
    "no-results": "Master, it's so~ empty here ðŸ˜¢ How about changing the filters?"
  },
  "details": {
    "header": "Popular Free Games",
    "title": "",
    "version": "Version",
    "description": "A mysterious witch accidentally travels to the world of Naruto and joins the Hidden Leaf Village. Here, you fight alongside many female Naruto heroes to protect your home. You face powerful forces that threaten the village and world peace. Throughout this journey, you grow and become a true ninja.",
    "introduction": "Game Introduction",
    "introduce": "The mobile game 'Naruto' is based on the anime's storyline, telling the story of the protagonist who strives to protect the ninja world and dreams of becoming the king of the Hokage harem. Players can collect ninjas such as Naruto Uzumaki, Sasuke Uchiha, and Sakura Haruno to safeguard the ninja world. The game features battle development elements such as magatama, talents, tailed beasts, and artifacts, as well as PvP modes like ranking battles and point-based competitions. Experience unique adult gameplay, including the Geisha Research Institute, and unlock stories of many beautiful female ninjas. This game features a Hokage-style training system, allowing you to recruit powerful ninjas like Naruto, Sasuke, Kakashi, Pain, and Obito to form the strongest lewd ninja squad. Accept various missions and claim rewards upon completion. Play Naruto Desire Special and become the ultimate Hokage. 1. You can also form your own ninja village and battle against others to bring glory and victory to your village. 2. Besides training and equipping your female ninjas, the game also offers brand-new social features. 3. You can interact with other players, make new friends, and build your own harem path. These interactions and communications provide additional in-game resources and rewards.",
    "notFound": "Sorry~ This game was not found!",
    "noDetails": "There are no more details available for this game~!"
  },
  "breadcrumb": {
    "home": "Home",
    "hotFreeGames": "Popular Free Games",
    "appStore": "Download from App Store"
  },
  "notFound": {
    "message": "Sorryï½žPage Not Found"
  },
  "iosDownload": {
    "download": {
      "title": "Download",
      "subtitle": "How to Download the Game on iOS Devices",
      "content": "Use an iOS device or mobile phone to directly click [Download Game] and follow the on-screen instructions for installation. If direct download is not possible, please try using [IPA Download] and follow the installation steps.",
      "btn": "Download Game"
    },
    "ipa": {
      "title": "IPA",
      "subtitle": "Adjustments to iOS Installation Methods",
      "content1": "Due to Apple policy changes affecting the original mobile download service, our team is actively seeking solutions to restore the service as soon as possible. For now, players can install the game on a computer using a personal certificate method.",
      "content2": "Applications installed using an Apple ID signature are valid for 7 days. If you see 'App can no longer be used' after 7 days, you can re-download it using the same Apple ID.",
      "btn": "Download IPA Game Installation Package"
    },
    "steps": {
      "title": "Installation Steps",
      "content1": "1. Download iTunes from Apple's official website and ensure it is linked to your iDevice (do not use the Microsoft Store version of iTunes).",
      "content2": "2. Install the latest version of Sideloadly on your computer. Download link:",
      "content3": "3. View installation tutorials (video steps available).",
      "btn": "Official Download"
    },
    "questions": {
      "title": "Q&A",
      "content": "Using an Apple ID signature, also known as a 'personal certificate,' here are some common issues encountered when signing an IPA file with Sideloadly:",
      "question1": "Why do I see the message 'Developer Mode must be enabled' when opening the app?",
      "answer1": "If your device is running iOS 16, go to Settings > Privacy & Security, scroll to the bottom, and enable Developer Mode. After enabling it, restart your device, and then try opening the app again.",
      "question2": "Which operating systems support Sideloadly?",
      "answer2": "Sideloadly runs on Windows 7, 8, 10, and 11. For optimal performance, Windows 10 or later is recommended. It also runs on macOS 10.12 Sierra and later, with macOS Catalina, Big Sur, Monterey, or later recommended for best performance.",
      "question3": "Why doesn't Sideloadly detect my device?",
      "answer3": "If this happens, restart your PC, open iTunes while your device is connected, and ensure you tap 'Trust' on the popup from your iDevice. Then, open Sideloadly again. If the issue persists, try uninstalling and reinstalling iTunes.",
      "question4": "Do I need to jailbreak my device to install signed apps?",
      "answer4": "No. Whether using a certificate signature or an Apple ID signature, jailbreaking is not required for installation.",
      "question5": "Do I need to disable two-factor authentication on my Apple ID for signing?",
      "answer5": "No. You can sign IPA files whether two-factor authentication is enabled or not. However, if two-factor authentication is enabled, you will need to verify your Apple ID the first time, but not for subsequent uses.",
      "question6": "How long is the signed app valid?",
      "answer6": "IPA files signed with a certificate will work until the certificate expires. If the certificate is revoked before expiration, the app will no longer open ('signature revoked'). Apps installed using an Apple ID signature are valid for 7 days. After 7 days, you can re-download the app using the same Apple ID.",
      "question7": "How many apps can be installed?",
      "answer7": "On iOS 7, 8, and 9, you can install unlimited apps on your device. However, free developer accounts have limitations. On iOS 10, 11, 12, 13, 14, and later, only three apps can be installed at the same time."
    }
  }
}
